#define _CRT_SECURE_NO_WARNINGS 

#include <stdio.h>

//int main()
//{
//	int a = 10;
//	int b = 20;
//	int c = 0;
//	scanf("%d", &c);
//	int d = a * c + b;
//	printf("%d\n", d);
//
//	return 0;
//}

//！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！
//指綱匯和岻念議岑紛。
//母呂和旗鷹議園亟狛殻。
//
//
//！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！

int main()
{
	int i = 0;

	int sum = 0;

	for (i = 0; i <= 100; i++)
	{
		sum = sum + i;
	}

	printf("%d\n", sum);

	return 0;
}


//！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！
//園亟阻匯倖for儉桟。
//糞�崛�1-100議拙紗箔才。
//
//
//！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！！